{
    "Super-Text": "Crossing the Lines: New Frontiers",
    "Title" : "12th Annual Hisar Coding Summit",
    "About Us": "Hisar Coding Summit, which was initially created to develop the potential of our students within the scope of digital transformation, will be held for the 12th time this year at Hisar Schools on 12-13 December 2025. Hisar Coding Summit will be in both English and Turkish making it an international event with 18 workshops and 3 speakers",
    "Join Text": "Are you Coding Summitists ready? We are bringing you together for the 12th time of Hisar Coding Summit!",
    "Join Button": "Join the Summit",
    "See Program": "See Program",
    "Navbar": {
        "Home": {"name": "Home", "link": "/#home"},
        "About Us": {"name": "About Us", "link": "/#about-us"},
        "12th Event Schedule": {"name": "12th Event Schedule", "link": "/#program"},
        "Join Coding Summit": {"name": "Join Coding Summit", "link": "/#join"}
    },
    "Fablab Header": "FabLab: Idealab",
    "Fablab Text": "For a decade, Idealab has been the heartbeat of innovation, a thriving maker space where boundless creativity and collaborative spirit converge to turn dreams into reality.",
    "Fablab Image Text 1": "Coding Since 2013",
    "Fablab Image Text 2": "With the power of Learning",
    "Gathertown Title": "Gathertown: Project Fair",
    "Gathertown Text": "Our project Fair of Coding Summit 12 will be held Online in GatherTown. We are open to all projects that align with the motto Decade of Learning: Celebrating the Impact of Innovation, and may be of your interest in any interdisciplinary area that displays the intersection of innovation and technology.",
    "Workshop Text": "Student Lead Workshops",
    "Gathertown Button Text": "Join as a Presenter",
    "Gathertown Button Link": "https://forms.gle/YiNCZXMZYvuR5irs7",
    "Workshops": {
        "Face To Face": {
            "AR-Enhanced Mechanical Systems: Automata": {
                "description":"Automata are 3D kits we designed and produced to help K–12 students understand mechanical systems. They are intended to teach fundamental mechanisms—such as gears and cam systems—that are frequently encountered in everyday life. To observe how these systems work, the kits are enhanced with augmented reality (AR), offering interactive, customizable animated visuals that push the boundaries of imagination!",
                "image": "./images/workshops/IntroductionToAI.png"
            },
            "FRC Robotics Sprint - Robot In 4 Hours": {
                "description":"In this workshop, participants collaborate to design and build a  robot. Students take on  roles in areas like mechanics, electronics, and software, contributing to different components of the robot. During the workshop, they apply skills in engineering design, problem-solving, rapid prototyping, and task planning. By the end of the session, the robot is tested, allowing students to experience the engineering process of a real FRC team on a smaller scale.",
                "image": "./images/workshops/bilgisayargörüşüilesporistatistiği.png"
            },
            "Machine Learning for Kids": {
                "description":"In this class, students will be introduced to the topic of machine learning through interactive activities. They will learn how to train models, make predictions, and understand the ethics of Al. The course is designed to be fun and engaging introducing children to the basics of this exciting technology.",
                "image": "./images/workshops/machineLearningForKids.png"
            },
            "2D Game Development with Godot: Monster Attack!": {
                "description":"In this workshop, students develop their own interactive games using the Godot game engine. They create a game loop by adding character control, a scoring system, and basic physics rules. The process offers a creative exploration of both programming and game logic.",
                "image": "./images/workshops/Automata.png"
            },
            "Building Bio-inspired Robots: Lemon": {
                "description":"Lemon is a robotics education kit that allows beginners to improve their knowledge of mechanics, electronics, 3D design, and biomimetic robots. It helps develop students’ understanding of robotics and computer sciences while guiding their discovery of the procedure of making a robot. It serves as an introductory kit, focusing on each step’s specific aspect of modeling.",
                "image": "./images/workshops/limePrototype.jpeg"
            },
            "Cardboard Robotics With micro:bit": {
                "description":"In this workshop, students build and race creative robots. Using Micro:bit, cardboard, and servo motors, they learn the fundamentals of robot design, basic electronics, and coding. With its fun and hands-on approach, the workshop offers a comprehensive learning experience—from building robots to programming them. By the end of the session, students will have the opportunity to code and control their own robot designs while enhancing their electronic skills.",
                "image": "./images/workshops/testudo.jpeg"
            },
            "Swıft Playground + CoreML: Visual Detection App": {
                "description":"In this workshop, students develop their own “image recognition” applications using SwiftUI and CoreML. Participants design a mobile system that detects and classifies  images, experiencing how artificial intelligence is used in daily life. The application identifies objects, determines their categories. During this process, students learn concepts of mobile development, model integration, and data processing, exploring coding in a tangible and creative way.",
                "image": "./images/workshops/bandlab.png"
            },
            "PiWars Competition: Designing and Building Robots": {
                "description": "In the PiWars workshop, students develop Raspberry Pi–based robots and learn to solve autonomous tasks using sensors. They combine mechanical, electronic, and software components to prepare their robots for competition within their teams. At the end of the event, the robots are evaluated based on speed, accuracy, and durability.",
                "image": "./images/workshops/Cybersecurity.png"
            },
            "Cybersecurity Workshop: Hacking Modems": {
                "description":"In this training, we will use a man-in-the-middle attack to find a modem’s password and access information about devices connected to that Wi-Fi network. Additionally, we will hack a virtual machine to examine how malicious hackers operate and discuss ways to defend against them. In the remaining time, there will be an interactive session to discuss participants’ personal curiosities and questions.",
                "image": "./images/workshops/çocuuklariçinswift.png"
            },
            "3D Toy Design and Production wıth TinkerCad": {
                "description":"Tinkercad is an intuitive design platform that allows students to take their first steps into the world of 3D modeling. Participants combine geometric shapes to create toys, vehicles, or decorative objects. By the end of the workshop, everyone will have completed their own toy digitally and produced it physically using 3D printing.",
                "image": "./images/workshops/kartondanmicobit.png"
            },
            "Cut&Build: Layered Models with Laser Cutter": {
                "description":"Participants use CNC technology to create multi-layered models and mechanical systems. They plan their designs digitally, generate cutting files, and then assemble their physical models. This workshop serves as an ideal introduction for students interested in exploring digital fabrication processes.",
                "image": "./images/workshops/algoritmikdüşünce.png"
            },
            "Design Your Own Sticker: Vinyl Cutting Workshop": {
                "description":"Students design multi-colored sticker sets using vinyl cutting technology. By creating layered graphics in a digital environment, they learn about color management, composition, and production processes. At the end of the workshop, everyone produces their own personalized designs and experiences the joy of digital fabrication.",
                "image": "./images/workshops/swiftileuygulamatasarlama.png"
            },
            "Music Composition wıth AI: Java Workshop": {
                "description":"In this workshop, students design their own music generation systems using the Java programming language and AI. Participants develop an algorithm that analyzes  note sequences and generates new melodies based on these patterns. By exploring the creative potential of artificial intelligence in music, students work on data analysis, sequence prediction, and algorithm design. By the end of the workshop, everyone will have composed music through code.",
                "image": "./images/workshops/entre.png"
            },
            "Technovation Girls: Prototype for Impact": {
                "description":"Participants form teams to address a social problem and develop a mobile application prototype. Throughout the process, they enhance their skills in idea generation, user analysis, and presentation. The workshop offers an entrepreneurial experience focused on creating social impact through technology.",
                "image": "./images/workshops/printinplace.png"   
            },
            "Quantum Computing": {
                "description":"Participants explore how quantum physics merges with computer science through gamified examples. They learn the concepts of qubits, superposition, and measurement through intuitive experiments. This workshop serves as an introduction to the future of computing.",
                "image": "./images/workshops/unity.png"   
            },
            "Modeling & Visualization wıth Julia": {
                "description":"In this course, various mathematical and physical concepts will be modeled using the Julia programming language, employing equations related to these concepts. Initially, the models will focus on static concepts, but later, time-dependent modeling will also be included. The modeling will be accomplished using various libraries built into Julia. By the end of the training, participants will be able to visualize key mathematical concepts in Julia.",
                "image": "./images/workshops/julia.png"   
            },
            "Minds and Machines: Prototyping R&D Quickshop": {
                "description":"This workshop aims to solve interdisciplinary problems by understanding the interaction between STEM, society, and technology. Participants develop computational thinking and design-based research skills while analyzing complex systems. Throughout the session, they engage in ideation, problem definition, hypothesis building, and project writing. This process enables students to formulate their ideas and transform them into research.",
                "image": "./images/workshops/javailehesapmakinesi.png"   
            },
            "Customize Your Own Keychaın wıth Onshape": {
                "description":"n this workshop, students design and customize their own 3D keychains using Onshape, a professional cloud-based CAD platform. Participants learn the basics of 3D modeling, including sketching, extruding, and text engraving. Throughout the process, they develop spatial reasoning and design-thinking skills while exploring digital fabrication. By the end of the session, each student will have created a personalized keychain ready for 3D printing.",
                "image": "./images/workshops/javailehesapmakinesi.png"   
            }
        }
    },
    "Program Text": "Daily Program",
    "Programs": {
        "Day 1": {
            "9:00 - 15:30": "Internal Event - Hisar Students Only ",
            "9:00 - 12:00": "1st Session",
            "12:00 - 15:30": "2nd Session",
            "17:00": "Speaker TBA",
            "18:30": "Speaker TBA",
            "20:00": "Speaker TBA",
            "Date": "13 December | Friday"
        },
        "Day 2": {
            "09:00 - 09:30": "Welcoming, Opening Ceramony and Speech",
            "09.:30 - 11:30": "1st Session",
            "11.30 - 12:20": "Lunch Break",
            "12:20 - 14:20": "2nd Session",
            "14:20 - 14:30": "Break",
            "14:30 - 16:00": "3rd Session",
            "16:00 - 16:30": "PiWars & micro:bit Yarışması",
            "16:30 - 16:50": "Brownie Wars",
            "16:50 - 17:00": "Closing Ceremony",
            "Date": "14 December | Saturday"
        }
    },
    "Speakers": {
        "Speaker 1": {
            "Name": "Speaker 1",
            "Description": "Speaker 1",
            "Expertise": "HTML",
            "Image": "https://via.placeholder.com/150"
        },
        "Speaker 2": {
            "Name": "Speaker 2",
            "Description": "Speaker 2",
            "Expertise": "HTML",
            "Image": "https://via.placeholder.com/150"
        },
        "Speaker 3": {
            "Name": "Speaker 3",
            "Description": "Speaker 3",
            "Expertise": "HTML",
            "Image": "https://via.placeholder.com/150"
        }
    },
    "Session Text": "Workshop Sessions",
    "Sessions": {
       "Friday": {
            "1st Session": [
                "AR interactive Mechanical Systems:Automata",
                "Building Bio-inspired Robots with Lemon",
                "Building Magnetic Turtle: Testudo",
                "Making Songs with Bandlab",
                "Machine Learning for kids",
                "The Depths of Cybersecurity: Thinking Like a Hacker",
                "Designing Apps for Kids with Swift",
                "Making Cardboard Robot with Microbit",
                "Minds and Machines: Computational Thinking for Interdisciplinary Problem Solving"

            ],
            "2nd Session": [
                "Mobile App Designing with Swift",
                "The Depths of Cybersecurity: Thinking Like a Hacker",
                "Creating a Maze Solving Application with Artificial Intelligence",
                "Introduction To AI",
                "Idea Factory: Create Your Own Start-up",
                "Minds and Machines: Computational Thinking for Interdisciplinary Problem Solving",
                "Building Bio-inspired Robots with Lemon",
                "Print-in-Place Magic: Designing 3D Printable Toys with Onshape"

            ]
       },
       "Saturday": {
            "1st Session": [
               "Keeping Sports Data and Making Predictions using Computer Vision",
               "Making Songs with Bandlab",
               "AR Interactive Mechanical Systems:Automata",
               "Building Bio-inspired Robots with Lemon",
               "Designing Apps for Kids with Swift",
               "Mobile App Designing with Swift",
               "Minds and Machines: Computational Thinking for Interdisciplinary Problem Solving",
               "Idea Factory: Create Your Own Start-up",
               "Mathematical and Physical Modeling with Julia",
               "Building Magnetic Turtle: Testudo"
            ],
            "2nd Session": [
                "Make Your Own Calculator Using Java Programming",
                "Machine Learning for Kids",
                "The Depths of Cybersecurity: Thinking Like a Hacker",
                "Making Cardboard Robot with Microbit",
                "Mobile App Designing with Swift",
                "Minds and Machines: Computational Thinking for Interdisciplinary Problem Solving",
                "Print-in-Place Magic: Designing 3D Printable Toys with Onshape",
                "Making a Sword Game with Unity 3D",
                "Mathematical and Physical Modeling with Julia",
                "Introduction to AI",
                "AR Interactive Mechanical Systems:Automata"
            ],
            "3rd Session": [
                "Building Bio-inspired Robots with Lemon",
                "The Depths of Cybersecurity: Thinking Like a Hacker",
                "Designing Apps for Kids with Swift",
                "Making Cardboard Robot with Microbit",
                "Machine Learning for Kids",
                "Print-in-Place Magic: Designing 3D Printable Toys with Onshape",
                "Idea Factory: Create Your Own Start-up",
                "Making a Sword Game with Unity 3D",
                "Introduction to AI",
                "Making Songs with Bandlab",
                "Building Magnetic Turtle: Testudo"
            ]
        }
    },
    "Giant Join": "Join Coding Summit 11",
    "Join Button Text": "Fill Out Form",
    "Location": "Where to find us?",
    "Contact": "Contact Us"
}
